# Задача 16:
# Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

findMe = input("Введите число для поиска:")
elements = str.split(input("Введите список элементов:"))

counter = 0 
for i in elements: 
    if i == findMe:
        counter = counter+1 

print(f"Значение {findMe} встречается в списке {counter} раз.")